src/Catalogs/НалоговыеНазначенияАктивовИЗатрат/НалоговыеНазначенияАктивовИЗатрат.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>НалоговыеНазначенияАктивовИЗатрат</name>
  <comment>(Регл)</comment>
  <predefined>
    <items>
      <name>НКУ_БытУслуги</name>
      <description>Быт. усл. (пат.)</description>
    </items>
    <items>
      <name>БытУслуги</name>
      <description>Быт. усл. (пат.)</description>
    </items>
    <items>
      <name>БытУслугиАморт</name>
      <description>Быт. усл. (пат.), аморт.</description>
    </items>
    <items>
      <name>БытУслугиАмортНеОблагНДС</name>
      <description>Быт. усл. (пат.), аморт., не обл. НДС</description>
    </items>
    <items>
      <name>БытУслугиНеОблагНДС</name>
      <description>Быт. усл. (пат.), не обл. НДС</description>
    </items>
    <items>
      <name>НКУ_ИгорБизнес</name>
      <description>Игор. бизнес (пат.)</description>
    </items>
    <items>
      <name>ИгорБизнес</name>
      <description>Игор. бизнес (пат.)</description>
    </items>
    <items>
      <name>ИгорБизнесАморт</name>
      <description>Игор. бизнес (пат.), аморт.</description>
    </items>
    <items>
      <name>ИгорБизнесАмортНеОблагНДС</name>
      <description>Игор. бизнес (пат.), аморт., не обл. НДС</description>
    </items>
    <items>
      <name>ИгорБизнесНеОблагНДС</name>
      <description>Игор. бизнес (пат.), не обл. НДС</description>
    </items>
    <items>
      <name>НДС_НеоблагаемаяХозДеятельность</name>
      <description>Необл. НДС, любая хоз.</description>
    </items>
    <items>
      <name>НДС_НеоблагаемаяНеХозДеятельность</name>
      <description>Необл. НДС, нехоз.</description>
    </items>
    <items>
      <name>НКУ_НеХозДеятельность</name>
      <description>Нехоз. д-сть</description>
    </items>
    <items>
      <name>НеХозДеятельность</name>
      <description>Нехоз. д-сть</description>
    </items>
    <items>
      <name>НеХозДеятельностьАморт</name>
      <description>Нехоз. д-сть, аморт.</description>
    </items>
    <items>
      <name>НеХозДеятельностьАмортНеОблагНДС</name>
      <description>Нехоз. д-сть, аморт., не обл. НДС</description>
    </items>
    <items>
      <name>НеХозДеятельностьНеОблагНДС</name>
      <description>Нехоз. д-сть, не обл. НДС</description>
    </items>
    <items>
      <name>НДС_Облагаемая</name>
      <description>Обл. НДС</description>
    </items>
    <items>
      <name>ОбмВалюты</name>
      <description>Обм. вал. (пат.)</description>
    </items>
    <items>
      <name>НКУ_ОбмВалюты</name>
      <description>Обм. вал. (пат.)</description>
    </items>
    <items>
      <name>ОбмВалютыАморт</name>
      <description>Обм. вал. (пат.), аморт.</description>
    </items>
    <items>
      <name>ОбмВалютыАмортНеОблагНДС</name>
      <description>Обм. вал. (пат.), аморт., не обл. НДС</description>
    </items>
    <items>
      <name>ОбмВалютыНеОблагНДС</name>
      <description>Обм. вал. (пат.), не обл. НДС</description>
    </items>
    <items>
      <name>НДС_Пропорционально</name>
      <description>Пропорц. обл. НДС</description>
    </items>
    <items>
      <name>Распределяемое</name>
      <description>Распределяемое</description>
    </items>
    <items>
      <name>РаспределяемоеАмортизация</name>
      <description>Распределяемое (амортизация)</description>
    </items>
    <items>
      <name>ТоргДеятельность</name>
      <description>Торг. д-сть (пат.)</description>
    </items>
    <items>
      <name>НКУ_ТоргДеятельность</name>
      <description>Торг. д-сть (пат.)</description>
    </items>
    <items>
      <name>ТоргДеятельностьАморт</name>
      <description>Торг. д-сть (пат.), аморт.</description>
    </items>
    <items>
      <name>ТоргДеятельностьАмортНеОблагНДС</name>
      <description>Торг. д-сть (пат.), аморт., не обл. НДС</description>
    </items>
    <items>
      <name>ТоргДеятельностьНеОблагНДС</name>
      <description>Торг. д-сть (пат.), не обл. НДС</description>
    </items>
    <items>
      <name>НКУ_ХозДеятельность</name>
      <description>Хоз. д-сть</description>
    </items>
    <items>
      <name>ХозДеятельность</name>
      <description>Хоз. д-сть</description>
    </items>
    <items>
      <name>ХозДеятельностьАморт</name>
      <description>Хоз. д-сть, аморт.</description>
    </items>
    <items>
      <name>ХозДеятельностьАмортНеОблагНДС</name>
      <description>Хоз. д-сть, аморт., не обл. НДС</description>
    </items>
    <items>
      <name>ХозДеятельностьНеОблагНДС</name>
      <description>Хоз. д-сть, не обл. НДС</description>
    </items>
  </predefined>
  <attributes>
    <name>ВидНалоговойДеятельности</name>
    <type>
      <types>CatalogRef.ВидыНалоговойДеятельности</types>
    </type>
  </attributes>
  <attributes>
    <name>Амортизируется</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидДеятельностиНДС</name>
    <type>
      <types>EnumRef.ВидыДеятельностиНДС</types>
    </type>
  </attributes>
  <attributes>
    <name>Используется</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ГруппаНалоговогоНазначения</name>
    <type>
      <types>EnumRef.ГруппыНалоговыхНазначений</types>
    </type>
  </attributes>
</mdclass:Catalog>

src/Enums/ГруппыНалоговыхНазначений/ГруппыНалоговыхНазначений.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ГруппыНалоговыхНазначений</name>
  <enumValues>
    <name>НалоговыеНазначенияДоНКУ</name>
  </enumValues>
  <enumValues>
    <name>НалоговыеНазначенияАктивовИВзаиморасчетовПоНДС</name>
  </enumValues>
  <enumValues>
    <name>НалоговыеНазначенияДоходовИЗатрат</name>
  </enumValues>
</mdclass:Enum>

src/Catalogs/НалоговыеНазначенияАктивовИЗатрат/ObjectModule.bsl
// Функция проверяет, существуют ли ссылки на налоговое назначение в движениях регистров накопления.
//
// Параметры:
//  Нет.
//
// Возвращаемое значение:
//  Истина - если есть движения, Ложь - если нет.
//
Функция СуществуютСсылки() Экспорт

	Возврат ПолныеПрава.НалоговоеНазначение_СуществуютСсылки(Ссылка);

КонецФункции //  СуществуютСсылки()


Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;	
	
	Если ПометкаУдаления Тогда   
		// пометку удаления разрешаем всегда
		Возврат;		                   
	КонецЕсли; 
	
	
	Если Не ЗначениеЗаполнено(ГруппаНалоговогоНазначения) Тогда
		Сообщить("Не заполнена группа налогового назначения " + Наименование + " !",
				 СтатусСообщения.Важное);
		Отказ = Истина;
		Возврат;
	Иначе
		Если ГруппаНалоговогоНазначения = Перечисления.ГруппыНалоговыхНазначений.НалоговыеНазначенияАктивовИВзаиморасчетовПоНДС Тогда
			// в этой группе нельзя новые вводить новые назначения и изменять ВидНалоговойДеятельности и ВидДеятельностиНДС
			Если ЭтоНовый() ИЛИ (ВидНалоговойДеятельности <> Ссылка.ВидНалоговойДеятельности) ИЛИ (ВидДеятельностиНДС <> Ссылка.ВидДеятельностиНДС) Тогда
				Сообщить("Нельзя вводить новые и изменять налоговые назначения из группы налоговых назначений ""Активов и взаиморасчетов по НДС""!", 
						 СтатусСообщения.Важное);
				Отказ = Истина;
				Возврат;
			КонецЕсли;	
		ИначеЕсли ГруппаНалоговогоНазначения = Перечисления.ГруппыНалоговыхНазначений.НалоговыеНазначенияДоходовИЗатрат Тогда	
			// ВидДеятельностиНДС должен быть пустым
			ВидДеятельностиНДС = Перечисления.ВидыДеятельностиНДС.ПустаяСсылка();
		КонецЕсли; 
	КонецЕсли; 
	
	Если НЕ ЭтоНовый() 
		И ВидНалоговойДеятельности = Ссылка.ВидНалоговойДеятельности 
		И Амортизируется = Ссылка.Амортизируется
		И ВидДеятельностиНДС = Ссылка.ВидДеятельностиНДС
		И ГруппаНалоговогоНазначения = Ссылка.ГруппаНалоговогоНазначения
		
		Тогда
	    // 	Если не изменяем тройку налоговых реквизитов и группу налогового назначения (а только "Используется" или Наименование) - разрешаем это делать всегда
		Возврат;		                   
	КонецЕсли; 
	
	// Налоговое назначение нельзя записывать с такой же тройкой налоговых реквизитов и группой, как и существующие налоговые назначения
	УсловиеСсылка = "";
	
	Запрос = Новый Запрос;
	
	Если НЕ ЭтоНовый() Тогда  
		УсловиеСсылка = " И НалоговыеНазначенияАктивовИЗатрат.Ссылка <> &Ссылка ";
		Запрос.УстановитьПараметр("Ссылка", Ссылка); 
	КонецЕсли;	
	
	Запрос.Текст = "ВЫБРАТЬ
				   |	НалоговыеНазначенияАктивовИЗатрат.ГруппаНалоговогоНазначения,
				   |	НалоговыеНазначенияАктивовИЗатрат.ВидНалоговойДеятельности,
				   |	НалоговыеНазначенияАктивовИЗатрат.Амортизируется,
				   |	НалоговыеНазначенияАктивовИЗатрат.ВидДеятельностиНДС,
				   |	НалоговыеНазначенияАктивовИЗатрат.Представление
				   |ИЗ
				   |	Справочник.НалоговыеНазначенияАктивовИЗатрат КАК НалоговыеНазначенияАктивовИЗатрат
				   |ГДЕ
				   |	НалоговыеНазначенияАктивовИЗатрат.ГруппаНалоговогоНазначения = &ГруппаНалоговогоНазначения
				   |	И НалоговыеНазначенияАктивовИЗатрат.ВидНалоговойДеятельности = &ВидНалоговойДеятельности
				   |	И НалоговыеНазначенияАктивовИЗатрат.Амортизируется = &Амортизируется
				   |	И НалоговыеНазначенияАктивовИЗатрат.ВидДеятельностиНДС = &ВидДеятельностиНДС
				   |" + УсловиеСсылка + "
				   |";
				   
				   
	Запрос.УстановитьПараметр("ГруппаНалоговогоНазначения", ГруппаНалоговогоНазначения); 			   
	Запрос.УстановитьПараметр("ВидНалоговойДеятельности", ВидНалоговойДеятельности); 
	Запрос.УстановитьПараметр("Амортизируется", Амортизируется); 
	Запрос.УстановитьПараметр("ВидДеятельностиНДС", ВидДеятельностиНДС); 
				   
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	СуществующиеНН = "";
	Пока Выборка.Следующий() Цикл
		СуществующиеНН = СуществующиеНН + Выборка.Представление + Символы.ПС;
	КонецЦикла;
	
	Если СуществующиеНН <> "" Тогда
		Сообщить("Налоговое назначение не может быть записано, 
				 |так как уже существуют налоговые назначения с такими же налоговыми реквизитами:" 
				 + Символы.ПС + СуществующиеНН, 
				 СтатусСообщения.Важное);
		Отказ = Истина;
	КонецЕсли; 
	
	
	Если НЕ ЭтоНовый() Тогда   
		
		Если Предопределенный И Используется = Ссылка.Используется Тогда  
			// предопределенные нельзя изменять, кроме Используется	
			Сообщить("Запрещено изменять предопределенные налоговые назначения.
					 |Элемент не записан.", 
					 СтатусСообщения.Важное);
			Отказ = Истина;
		ИначеЕсли (ГруппаНалоговогоНазначения <> Ссылка.ГруппаНалоговогоНазначения)
			ИЛИ (ВидНалоговойДеятельности <> Ссылка.ВидНалоговойДеятельности)
		 	ИЛИ (Амортизируется <> Ссылка.Амортизируется)
		 	ИЛИ (ВидДеятельностиНДС <> Ссылка.ВидДеятельностиНДС)
		 		Тогда
		    // существующие НН нельзя менять, если на них уже есть ссылки в регистрах накопления
			Если ЭтотОбъект.СуществуютСсылки() Тогда

				Сообщить("Существуют документы, проведенные по налоговому назначению """ + Наименование + """.
						 |Реквизиты ""Группа налогового назначения"", ""Вид налоговой деятельности"", ""Вид деятельности НДС"", 
						 |не могут быть изменены, элемент не записан.", 
						 СтатусСообщения.Важное);
				Отказ = Истина;

			КонецЕсли;
		КонецЕсли;
	КонецЕсли; 
	

КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если НЕ ЭтоНовый() Тогда
		ОбновитьПовторноИспользуемыеЗначения();
	КонецЕсли;	
	
КонецПроцедуры
